(function ($,root){
    // var arrTime = ["00:00.63","00:03.13","00:05.32","00:08.25","00:20.26","00:23.88","00:27.70","00:29.69"," 00:35.69"," 00:39.32"," 00:43.32",
    // " 00:46.69"," 00:49.51"," 00:51.20"," 00:54.46","01:02.21","01:09.46","01:17.58","01:24.48","01:41.35","01:45.29","01:47.10","01:53.05",
    // "01:56.74","02:00.63","02:04.07","02:06.89","02:08.65","02:19.52","02:26.83","02:34.96","02:42.33","03:01.96","03:09.96","03:14.15",
    // "03:17.21","03:25.48"];
    var arrTime = ["00:00","00:03","00:05","00:08","00:20","00:23","00:27","00:29"," 00:35"," 00:39"," 00:43",
    " 00:46"," 00:49"," 00:51"," 00:54","01:02","01:09","01:17","01:24","01:41","01:45","01:47","01:53",
    "01:56","02:00","02:04","02:06","02:08","02:19","02:26","02:34","02:42","03:01","03:09","03:14",
    "03:17","03:25"];
    var arrLrc =[ "丑八怪 - 薛之谦","作词：甘世佳","作曲：李荣浩","","","如果世界漆黑 其实我很美","在爱情里面进退 最多被消费",
    "不管同样的是非","又怎么不对 无所谓","如果像你一样 总有人谄媚","围绕着我的卑微 也许能消退","其实我并不在意 有很多机会","像巨人一样的无畏","放纵我心里的鬼",
    "可是我不配","丑八怪 能否别把灯打开","我要的爱 出没在漆黑一片的舞台","丑八怪 在这暧昧的时代","我的存在 像意外","有人用一滴泪 会红颜祸水","有人丢掉称谓 什么也不会","只要你足够虚伪","就不怕魔鬼 对不对",
    "如果剧本写好 谁比谁高贵","我只能沉默以对 美丽本无罪","当欲望开始贪杯 有更多机会","像尘埃一样的无畏","化成灰谁认得谁管他配不配","丑八怪 能否别把灯打开","我要的爱 出没在漆黑一片的舞台",
    "丑八怪 在这暧昧的时代","我的存在 不意外","丑八怪 其实见多就不怪","放肆去high 用力踩","那不堪一击的洁白","丑八怪 这是我们的时代","我不存在 才意外"];
    var $scope = $(document.body);

    function initLRC(data){
        var value;
        var len = arrTime.length;
        for(var i = 0;i< len;i++){
            if(data == arrTime[i]){
                value = arrLrc[i];
            }
        }
        var html = `<div class="lrcTable">
                     <p>value</p>
                </div>`;
        // $scope.html(html);
    }
    root.dealLrc = {
        initLRC: initLRC
    }
}(window.Zepto,window.player))